<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.AdobeAir</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/adobe</string>
		<key>NAME</key>
		<string>AdobeAIR</string>
		<key>URL</key>
		<string>http://airdownload.adobe.com/air/mac/download/latest/AdobeAIR.dmg</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Adobe AIR</string>
			<key>display_name</key>
			<string>Adobe Integrated Runtime</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.AdobeAIR</string>
</dict>
</plist>
